{
  "architectures": [
    "ProGen2ForPreTraining"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 1,
  "dtype": "float32",
  "embedding_dropout": 0.0,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu_new",
  "hidden_dropout": 0.0,
  "hidden_size": 1024,
  "id2label": null,
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "is_decoder": true,
  "label2id": null,
  "layer_norm_eps": 1e-05,
  "mask_token_id": 4,
  "max_position_embeddings": 1024,
  "model_type": "progen2",
  "null_token_id": null,
  "num_attention_heads": 16,
  "num_hidden_layers": 12,
  "num_labels": 1,
  "pad_token_id": 0,
  "rotary_dim": 32,
  "scale_attn_weights": true,
  "summary_activation": null,
  "summary_first_dropout": 0.1,
  "summary_proj_to_labels": true,
  "summary_type": "cls_index",
  "summary_use_proj": true,
  "task_specific_params": {
    "text-generation": {
      "do_sample": true,
      "max_length": 50,
      "temperature": 1.0
    }
  },
  "tie_word_embeddings": false,
  "tokenizer_class": "GPT2Tokenizer",
  "transformers_version": "5.9.0",
  "unk_token_id": 3,
  "use_cache": true,
  "vocab_size": 37
}
